loanController/app/views/employees/_form.html.erb

    <%= form.label :role_id %>
    <%= form.select("role_id", Role.all.collect {|r| [r.description, r.id]}, {include_blank: 'Select...'})%>
---
SELECT "roles"."description", "roles"."id" FROM "roles"

    <%= form.label :department_id %>
    <%= form.select("department_id", Department.all.collect {|d| [d.description, d.id]}, {include_blank: 'Select...'})%>
---
SELECT "departments"."description", "departments"."id" FROM "departments"