loanController/app/views/loans/_form.html.erb

    <%= form.label :employee_id %>
    <%= form.select("employee_id", Employee.all.collect {|e| [e.name, e.id]}, {include_blank: 'Select...'})%>
---
SELECT "employees"."name", "employees"."id" FROM "employees"