loanController/app/views/loans/show.html.erb

SELECT "installments".* FROM "installments" WHERE "installments"."loan_id" = ?  [["loan_id", 9]]
---
  <tbody>
    <% @loan.installments.each do |i| %>