loanController/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def correct_user?
        @user = User.find(params[:id])