loanController/app/controllers/departments_controller.rb

  def index
    @departments = Department.all
---
SELECT "departments".* FROM "departments"

  def create
    @department = Department.new(department_params)

    respond_to do |format|
      if @department.save
---
INSERT INTO "departments" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "IT"], ["created_at", "2023-11-02 17:29:38.527751"], ["updated_at", "2023-11-02 17:29:38.527751"]]

    def set_department
      @department = Department.find(params[:id])
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]