loanController/app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("name", "cpf", "employed_on", "remarks", "created_at", "updated_at", "role_id", "department_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_role_options
      @role_options = Role.all.pluck(:description, :id)
---
SELECT "roles"."description", "roles"."id" FROM "roles"

    def set_department_options
      @department_options = Department.all.pluck(:description, :id)
---
SELECT "departments"."description", "departments"."id" FROM "departments"