loanController/app/controllers/installments_controller.rb

    def pay_installment
        @installment = Installment.find(params[:id])
        @loan = Loan.find(@installment.loan_id)

        if @installment.update(paid_value: @installment.value)
            all_installments_are_paid = @loan.installments.all? { |i| i.value == i.paid_value }

            if all_installments_are_paid
                @loan.update(active: false)
---
SELECT  "installments".* FROM "installments" WHERE "installments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "loans" SET "active" = ?, "updated_at" = ? WHERE "loans"."id" = ?  [["active", 0], ["updated_at", "2023-11-04 18:28:22.951639"], ["id", 9]]
UPDATE "installments" SET "paid_value" = ?, "updated_at" = ? WHERE "installments"."id" = ?  [["paid_value", 4965.6], ["updated_at", "2023-11-04 18:22:52.639492"], ["id", 4]]
SELECT "installments".* FROM "installments" WHERE "installments"."loan_id" = ?  [["loan_id", 9]]