loanController/app/controllers/loans_controller.rb

SELECT "loans".* FROM "loans"
---
    def index
        @loans = Loan.all

INSERT INTO "installments" ("due_date", "value", "paid_value", "number", "created_at", "updated_at", "loan_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["due_date", "2023-11-09"], ["value", 4965.6], ["paid_value", 0.0], ["number", 1], ["created_at", "2023-11-04 18:00:16.482587"], ["updated_at", "2023-11-04 18:00:16.482587"], ["loan_id", 9]]
INSERT INTO "loans" ("date", "active", "first_due_date", "value", "number_of_installments", "created_at", "updated_at", "employee_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @loan = Loan.new(loan_params)
        @loan.active = true

        #gambiara do carajo
        @loan.installments = generate_installments_with_params(@loan.number_of_installments, @loan.value, @loan.first_due_date)

        respond_to do |format|
            if @loan.save

SELECT  "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
        def set_loan
            @loan = Loan.find(params[:id])

SELECT "employees"."name", "employees"."id" FROM "employees"
---
        def set_employee_options
            @employee_options = Employee.all.pluck(:name, :id)