loanController/app/controllers/roles_controller.rb

  def index
    @roles = Role.all
---
SELECT "roles".* FROM "roles"

  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save
---
INSERT INTO "roles" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Dev"], ["created_at", "2023-11-02 17:28:50.002814"], ["updated_at", "2023-11-02 17:28:50.002814"]]

    def set_role
      @role = Role.find(params[:id])
---
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]