loanController/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Lucas Daian Wagner"], ["password_digest", "$2a$12$EXK.cvCArkrSdd69vVkFwe.p/S875k2rJfFFYdDnpmwtoZK02Dztu"], ["updated_at", "2023-10-25 02:53:35.505024"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)